load-tests/librarian-full-scenario.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Librarian Assistant – Full Mixed Scenario" enabled="true">
      <stringProp name="TestPlan.comments">NFR-1 mixed-workload plan: 10 concurrent users, p95 &lt; 2s.
Workload mix: 40% search, 25% checkout, 15% return, 15% book detail, 5% my-checkouts.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="BASE_PORT" elementType="Argument">
            <stringProp name="Argument.name">BASE_PORT</stringProp>
            <stringProp name="Argument.value">8081</stringProp>
          </elementProp>
          <elementProp name="PATRON_EMAIL" elementType="Argument">
            <stringProp name="Argument.name">PATRON_EMAIL</stringProp>
            <stringProp name="Argument.value">patron@library.com</stringProp>
          </elementProp>
          <elementProp name="PATRON_PASSWORD" elementType="Argument">
            <stringProp name="Argument.name">PATRON_PASSWORD</stringProp>
            <stringProp name="Argument.value">password</stringProp>
          </elementProp>
          <elementProp name="LIBRARIAN_EMAIL" elementType="Argument">
            <stringProp name="Argument.name">LIBRARIAN_EMAIL</stringProp>
            <stringProp name="Argument.value">librarian@library.com</stringProp>
          </elementProp>
          <elementProp name="LIBRARIAN_PASSWORD" elementType="Argument">
            <stringProp name="Argument.name">LIBRARIAN_PASSWORD</stringProp>
            <stringProp name="Argument.value">password</stringProp>
          </elementProp>
          <!-- Book ID that always has copies available (seeded on startup) -->
          <elementProp name="BOOK_ID" elementType="Argument">
            <stringProp name="Argument.name">BOOK_ID</stringProp>
            <stringProp name="Argument.value">1</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ═══════════════════════════════════════════════════════════
           SETUP THREAD GROUP – Authenticate once per virtual user
           ═══════════════════════════════════════════════════════════ -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="Setup – Patron Login" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <!-- Patron login to obtain JWT token stored as property -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Patron Login" enabled="true">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/auth/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"email":"${PATRON_EMAIL}","password":"${PATRON_PASSWORD}"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Content-Type JSON" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <!-- Extract JWT token and store as JMeter property for cross-thread-group sharing -->
          <JSONPathExtractor guiclass="JSONPathExtractorGui" testclass="JSONPathExtractor" testname="Extract Patron JWT" enabled="true">
            <stringProp name="JSONPathExtractor.referenceName">PATRON_TOKEN</stringProp>
            <stringProp name="JSONPathExtractor.jsonPathExpr">$.token</stringProp>
            <stringProp name="JSONPathExtractor.defaultValue">TOKEN_NOT_FOUND</stringProp>
          </JSONPathExtractor>
          <hashTree/>
          <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="Store token as property" enabled="true">
            <stringProp name="script">props.put("PATRON_TOKEN", vars.get("PATRON_TOKEN"));</stringProp>
          </BeanShellPostProcessor>
          <hashTree/>
          <!-- Extract userId from login response -->
          <JSONPathExtractor guiclass="JSONPathExtractorGui" testclass="JSONPathExtractor" testname="Extract Patron User ID" enabled="true">
            <stringProp name="JSONPathExtractor.referenceName">PATRON_USER_ID</stringProp>
            <stringProp name="JSONPathExtractor.jsonPathExpr">$.userId</stringProp>
            <stringProp name="JSONPathExtractor.defaultValue">1</stringProp>
          </JSONPathExtractor>
          <hashTree/>
          <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="Store userId as property" enabled="true">
            <stringProp name="script">props.put("PATRON_USER_ID", vars.get("PATRON_USER_ID"));</stringProp>
          </BeanShellPostProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert Login 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">8</intProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ═══════════════════════════════════════════════════════════
           MAIN THREAD GROUP – Mixed workload (10 users, 120s)
           ═══════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="10 Concurrent Users – Mixed Workload" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <!-- Run for 120 seconds (increase to 7200 for full 2-hour NFR endurance run) -->
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">120</stringProp>
        <stringProp name="ThreadGroup.delay">2</stringProp>
      </ThreadGroup>
      <hashTree>

        <!-- Shared Authorization Header (populated from setup group property) -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Authorization Header" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${__P(PATRON_TOKEN)}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- HTTP Defaults -->
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
        </ConfigTestElement>
        <hashTree/>

        <!-- ─── 40%: Search Books ─── -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="40% – Search Books" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <floatProp name="ThroughputController.percentThroughput">40.0</floatProp>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/books/search" enabled="true">
            <stringProp name="HTTPSampler.path">/api/books/search</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="query" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">true</boolProp>
                  <stringProp name="Argument.name">query</stringProp>
                  <!-- Rotate through common search terms -->
                  <stringProp name="Argument.value">${__chooseRandom(java,python,spring,design,clean,refactoring,algorithm,database,network,operating,java)}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Response time &lt; 2000ms" enabled="true">
              <stringProp name="DurationAssertion.duration">2000</stringProp>
            </DurationAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>

        <!-- ─── 15%: Get Book Detail ─── -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="15% – Get Book Detail" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <floatProp name="ThroughputController.percentThroughput">15.0</floatProp>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/books/{id}" enabled="true">
            <stringProp name="HTTPSampler.path">/api/books/${BOOK_ID}</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Response time &lt; 2000ms" enabled="true">
              <stringProp name="DurationAssertion.duration">2000</stringProp>
            </DurationAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>

        <!-- ─── 25%: Checkout Book ─── -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="25% – Checkout Book" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <floatProp name="ThroughputController.percentThroughput">25.0</floatProp>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/checkouts" enabled="true">
            <stringProp name="HTTPSampler.path">/api/checkouts</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="userId" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.name">userId</stringProp>
                  <stringProp name="Argument.value">${__P(PATRON_USER_ID)}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="bookId" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.name">bookId</stringProp>
                  <stringProp name="Argument.value">${BOOK_ID}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <!-- Extract checkout ID for subsequent return -->
            <JSONPathExtractor guiclass="JSONPathExtractorGui" testclass="JSONPathExtractor" testname="Extract Checkout ID" enabled="true">
              <stringProp name="JSONPathExtractor.referenceName">CHECKOUT_ID</stringProp>
              <stringProp name="JSONPathExtractor.jsonPathExpr">$.id</stringProp>
              <stringProp name="JSONPathExtractor.defaultValue">0</stringProp>
            </JSONPathExtractor>
            <hashTree/>
            <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Response time &lt; 2000ms" enabled="true">
              <stringProp name="DurationAssertion.duration">2000</stringProp>
            </DurationAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>

        <!-- ─── 15%: Return Book ─── -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="15% – Return Book" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <floatProp name="ThroughputController.percentThroughput">15.0</floatProp>
        </ThroughputController>
        <hashTree>
          <!-- Only execute if CHECKOUT_ID was captured (non-zero) -->
          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If CHECKOUT_ID exists" enabled="true">
            <stringProp name="IfController.condition">"${CHECKOUT_ID}" != "0"</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
          </IfController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/checkouts/{id}/return" enabled="true">
              <stringProp name="HTTPSampler.path">/api/checkouts/${CHECKOUT_ID}/return</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
            </HTTPSamplerProxy>
            <hashTree>
              <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Response time &lt; 2000ms" enabled="true">
                <stringProp name="DurationAssertion.duration">2000</stringProp>
              </DurationAssertion>
              <hashTree/>
            </hashTree>
          </hashTree>
        </hashTree>

        <!-- ─── 5%: View My Checkouts ─── -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="5% – My Checkouts" enabled="true">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <floatProp name="ThroughputController.percentThroughput">5.0</floatProp>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/checkouts/user/{id}" enabled="true">
            <stringProp name="HTTPSampler.path">/api/checkouts/user/${__P(PATRON_USER_ID)}</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
          </HTTPSamplerProxy>
          <hashTree>
            <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Response time &lt; 2000ms" enabled="true">
              <stringProp name="DurationAssertion.duration">2000</stringProp>
            </DurationAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>

        <!-- Think time: simulate realistic user pacing (500-1500ms between requests) -->
        <GaussianRandomTimer guiclass="GaussianRandomTimerGui" testclass="GaussianRandomTimer" testname="Think Time (500-1500ms)" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
          <stringProp name="RandomTimer.range">1000</stringProp>
        </GaussianRandomTimer>
        <hashTree/>

      </hashTree>

      <!-- ═══════════════════════════════════════════════════════════
           LISTENERS – Collect and report results
           ═══════════════════════════════════════════════════════════ -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/full-scenario-results.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>